<a href="https://colab.research.google.com/github/plthiyagu/Personnel/blob/master/All_in_All_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s= pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates= pd.date_range(20130101,periods=6)

In [5]:
dates

DatetimeIndex(['1970-01-01 00:00:00.020130101',
               '1970-01-02 00:00:00.020130101',
               '1970-01-03 00:00:00.020130101',
               '1970-01-04 00:00:00.020130101',
               '1970-01-05 00:00:00.020130101',
               '1970-01-06 00:00:00.020130101'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [7]:
df

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.065195  0.595063  0.900961 -1.118223
1970-01-02 00:00:00.020130101 -1.669334 -0.520929  0.412577 -1.156328
1970-01-03 00:00:00.020130101 -0.895461  0.221512 -0.543341  1.117244
1970-01-04 00:00:00.020130101  0.281467  0.250920 -1.631912 -0.066120
1970-01-05 00:00:00.020130101 -0.255642  1.039339 -1.698611  0.595765
1970-01-06 00:00:00.020130101 -1.120623  0.503826  0.351673 -1.894680

Create an empty DataFrame

In [8]:
df= pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

Create a DataFrame from List of Lists. Specify values for each row

In [9]:
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df= pd.DataFrame(data, columns=['name','age'])
print(df)

     name  age
0    Alex   10
1     Bob   12
2  Clarke   13

Create a DataFrame from a Dictionary of Lists. Specify values for each column

In [16]:
data = {'Name': ['Tom', 'Jack', 'Steve', 'Ricky'], 'Age': [28, 34, 29, 42]}
df= pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

Lowercase DataFrame columns names

In [17]:
df.columns = [x.lower() for x in df.columns]
# or
#df.columns = map(str.lower, df.columns)
df

    name  age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

Create a DataFrame with index

In [63]:
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df= pd.DataFrame(data,index=['a','b','c'])
df

        0   1
a    Alex  10
b     Bob  12
c  Clarke  13

Generate a random DataFrame

In [12]:
df = pd.DataFrame(np.random.rand(50, 5))
df

           0         1         2         3         4
0   0.019528  0.273417  0.345335  0.606843  0.379111
1   0.350631  0.107791  0.695129  0.485942  0.057987
2   0.312483  0.924513  0.479051  0.297287  0.704104
3   0.710936  0.438379  0.228676  0.913393  0.948597
4   0.350950  0.735264  0.234319  0.578735  0.269562
5   0.433441  0.562359  0.936612  0.305148  0.230789
6   0.326786  0.398726  0.127071  0.568933  0.083353
7   0.727180  0.403250  0.454428  0.375665  0.026898
8   0.760602  0.746704  0.554760  0.608154  0.245743
9   0.338016  0.476864  0.391530  0.919175  0.482276
10  0.224573  0.366236  0.577894  0.140256  0.187397
11  0.331821  0.640024  0.348365  0.365229  0.600517
12  0.072212  0.776457  0.516580  0.139717  0.512600
13  0.183566  0.124375  0.492059  0.171093  0.595278
14  0.857035  0.739112  0.207053  0.474095  0.866079
15  0.342054  0.314530  0.159282  0.249925  0.790376
16  0.325425  0.749782  0.341868  0.612829  0.118888
17  0.408828  0.100321  0.592710  0.968681  0.604193
18  0.760908  0.517090  0.089612  0.908859  0.004493
19  0.523183  0.087147  0.537269  0.991615  0.911761
20  0.905555  0.237470  0.779732  0.479370  0.020645
21  0.206488  0.742779  0.163500  0.683329  0.793725
22  0.460948  0.717479  0.286647  0.618618  0.194338
23  0.280484  0.074754  0.977410  0.709579  0.863827
24  0.677899  0.094040  0.670777  0.872438  0.559959
25  0.527219  0.099781  0.680611  0.024860  0.807179
26  0.616446  0.534516  0.414803  0.939613  0.157179
27  0.684419  0.164724  0.515236  0.503126  0.111553
28  0.205053  0.677316  0.488246  0.010423  0.762852
29  0.768158  0.391738  0.292464  0.130283  0.767301
30  0.305312  0.119182  0.532049  0.031842  0.209152
31  0.292272  0.994473  0.321568  0.135466  0.418683
32  0.946506  0.949908  0.575881  0.653123  0.291696
33  0.220314  0.504507  0.013666  0.485264  0.863077
34  0.671729  0.938245  0.789295  0.207059  0.997466
35  0.820399  0.076197  0.842438  0.303398  0.096656
36  0.139209  0.919718  0.176846  0.807011  0.424107
37  0.411197  0.643162  0.802515  0.899828  0.256445
38  0.942030  0.786816  0.788690  0.496682  0.671376
39  0.135319  0.075111  0.701746  0.604084  0.127780
40  0.069309  0.584964  0.662833  0.509458  0.182922
41  0.147447  0.591817  0.238633  0.765125  0.429613
42  0.859934  0.645034  0.411895  0.485594  0.200909
43  0.216192  0.520633  0.197247  0.879840  0.438972
44  0.599310  0.489665  0.631951  0.732061  0.691379
45  0.189322  0.709576  0.095098  0.179378  0.841101
46  0.320311  0.999949  0.390177  0.485392  0.601368
47  0.361083  0.362998  0.165454  0.579175  0.748922
48  0.676248  0.706316  0.445922  0.708159  0.993373
49  0.028647  0.280712  0.824687  0.163749  0.653819

Set a column as the dataframe index

In [19]:
df.columns

Index(['name', 'age'], dtype='object')

In [20]:
df = df.set_index('age')

Reset the dataframe index to the default integer index

In [21]:
df = df.reset_index()

Reset the dataframe index without inserting it into dataframe columns

In [22]:
df = df.reset_index(drop=True)

Rename several DataFrame columns

In [24]:
df = df.rename(columns = {'name':'name_new', 'age':'age_new'})
df
# or
#df.rename(columns = {'col1_old':'col1_new', 'col2_old':'col2_new', 'col1_old':'col2_new'}, inplace = True)

   age_new name_new
0       28      Tom
1       34     Jack
2       29    Steve
3       42    Ricky

Replace all column names

In [26]:
new_cols_names = ['name', 'age']
df.columns = new_cols_names
df

   name    age
0    28    Tom
1    34   Jack
2    29  Steve
3    42  Ricky

Remove/drop one column

In [ ]:
df = df.drop('column_x', axis = 1)

Remove/drop several columns

In [ ]:
df = df.drop(['column_x', 'column_y'], axis = 1)
# or
df = df.drop(columns = ['column_x', 'column_y'])

Remove/drop rows by index

In [ ]:
# drop rows 0 and 1
df = df.drop([0, 1])

Remove/drop first two rows

In [ ]:
df = df.drop(df.index[:2])

Remove/drop last two rows

In [ ]:
df = df.drop(df.index[-2:])

Remove/drop rows by names

In [27]:
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'], index = ['a', 'b', 'c'])
print(df)

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [28]:
df = df.drop(['b', 'c'])
print(df)

   Name  Age
a  Alex   10

Add column with all values a constant

In [ ]:
df['column_new'] = 7

Add column on specific position (as second column)

In [ ]:
df.insert(1, 'column_new', 7)

Add column based on values of other columns

In [ ]:
df['column_new'] = df.column_x + df.column_y

Add column with values from list

In [29]:
data = [['Alex', 10], ['Bob', 12], ['Marie', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df['column_new'] = ['boy', 'boy', 'girl']
print(df)

    Name  Age column_new
0   Alex   10        boy
1    Bob   12        boy
2  Marie   13       girl

Add new column based on values of other column and where condition

In [ ]:
df['colummn_new'] = 'yes'
df['colummn_new'] = df['colummn_new'].where(df['column_x']>=50, 'no')

# equivalent with and more intuitive
#df['colummn_new'] = np.where(df['column_x']>=50, 'yes', 'no')

Add new column based on values of other columns and where condition

In [ ]:
data = [['Alex', 10], ['Bob', 12], ['Marie', 21], ['Tina', 35]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df['Adult'] = 'yes'
df['Adult'] = df['Adult'].where(df['Age']>=18, 'no')

# or
import numpy as np
df['Adult'] = np.where(df['Age']>=18, 'yes', 'no')

Flatten/collapse the hierarchical index in columns

In [ ]:
df.columns = ['_'.join(col).strip() for col in df.columns.values]

Iterate over DataFrame rows (slow operation)

In [ ]:
# pandas vectorized functions should be used instead of rows iteration
for index, row in df.iterrows():
    # row is a Series object
    print(index, row['column_x'])

# or faster method
for row in df.itertuples():
    # row is a named tuple with associated column names
    print(row.Index, row.column_x, row.column_y)
    print(row[0], row[1], row[2])

Show the first 30 and last 30 rows

In [30]:
df

    Name  Age column_new
0   Alex   10        boy
1    Bob   12        boy
2  Marie   13       girl

Show info on index, data types, memory usage

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   Age         3 non-null      int64
 2   column_new  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

Show type of df object

In [32]:
type(df)

pandas.core.frame.DataFrame

Show the first 5 rows

In [33]:
df.head()

    Name  Age column_new
0   Alex   10        boy
1    Bob   12        boy
2  Marie   13       girl

Show the first 10 rows

In [ ]:
df.head(10)

Show “the index” (aka “the labels”)

In [34]:
df.columns
type(df.columns)

pandas.core.indexes.base.Index

Show data types of each column

In [ ]:
df.dtypes

Show number of rows and columns

In [35]:
df.shape

(3, 3)

Show number of rows only

In [36]:
df.shape[0]

3

Show number of columns only

In [37]:
df.shape[1]

3

Get DataFrame values as numpy array

In [38]:
df.values

array([['Alex', 10, 'boy'],
       ['Bob', 12, 'boy'],
       ['Marie', 13, 'girl']], dtype=object)

Show info on rows and columns indexes

In [39]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['Name', 'Age', 'column_new'], dtype='object')]

Get a concise summary of a DataFrame

In [40]:
import pandas as pd
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'], index = ['a', 'b', 'c'])

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 72.0+ bytes

Get memory usage by column

In [41]:
df.memory_usage()

Index    104
Name      24
Age       24
dtype: int64

Set maximum number of rows and columns printed to unlimited

In [42]:
# default is 60 rows
pd.set_option('max_rows', None)
# default is 20 columns
pd.set_option('max_columns', None)

Reset maximum number of rows and columns printed to default

In [43]:
pd.reset_option('max_rows')
pd.reset_option('max_columns')

Suppress scientific notation

In [ ]:
# display all floats with commas and two decimal places
pd.set_option('display.float_format', lambda x: '{:,.2f}'.format(x))
# or
pd.options.display.float_format = "{:,.2f}".format

Reset floats display

In [ ]:
pd.reset_option('display.float_format')

Change float format to two decimal places

In [ ]:
# using rounding
df['col_x'].round(2)
# using apply
df['col_x'].apply(lambda x: '{:.2f}'.format(x))

Set maximum number of rows and columns printed to unlimited temporary

In [ ]:
# settings are restored when you exit the 'with' block
with pd.option_context('max_rows', None, 'max_columns', None):
    print(df)

Sort dataframe by one column values ascending

In [43]:
df = df.sort_values('col_x')

Sort the dataframe by one column values descending

In [43]:
df = df.sort_values('col_x', ascending=False)

Sort the dataframe by one column values ascending, inplace

In [43]:
df.sort_values('col_x', inplace=True)

Sort the dataframe by multiple columns values

In [43]:
df = df.sort_values(['col_x','col_y','col_z'], ascending=[True, True, False])

Sort the dataframe based on the index labels ascending

In [43]:
df = df.sort_index()

Sort the dataframe based on the columns labels ascending

In [ ]:
df = df.sort_index(axis=1)

Sort the dataframe based on the columns labels ascending

In [58]:
import pandas as pd
data = {'Name': ['Tom', 'Jack', 'Steve', 'Ricky'], 'Age': [28, 34, 29, 42]}
df = pd.DataFrame(data)

In [45]:
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [46]:
df = df.sort_index(axis=1)

In [47]:
df

   Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky

Read csv file

In [47]:
df = pd.read_csv('local_path/file.csv')

Read csv file with | as fields separator

In [47]:
df = pd.read_csv('local_path/file.csv', sep='|')

Read only 10 rows of csv file

In [47]:
pd.read_csv('local_path/file.csv', nrows = 10)

Read csv file and skip first 3 rows

In [47]:
df = pd.read_csv('local_path/file.csv', skiprows = 3)

Read csv file and parse/treat columns as dates

In [47]:
df = pd.read_csv('local_path/file.csv', parse_dates = ['column_x_date', 'column_y_date'])

Read csv file while specifying column names

In [47]:
df = pd.read_csv('local_path/file.csv', names = ['column_1', 'column_2'])

Read csv file and set the index as column_id

In [47]:
df = pd.read_csv('local_path/file.csv', index_col = 'column_id')

Read csv file and set the index as multi columns

In [47]:
df = pd.read_csv('local_path/file.csv', index_col = ['column_id1', 'column_id2'])

Read csv file and set “.” as missing values

In [47]:
df = pd.read_csv('local_path/file.csv', na_values = ['.'])

Read csv file and set different missing values on columns

In [47]:
# `column_x` missing values to be set as `nope`
# `column_y` missing values to be set as `.`
missings = {'column_x': ['nope'], 'column_y': ['.']}
df = pd.read_csv('local_path/file.csv', na_values = missings)

Read csv file and prevent pandas from interpreting “NA” as NaN in a string

In [47]:
# The default NaN recognized values are ['-1.#IND', '1.#QNAN', '1.#IND',
# '-1.#QNAN', '#N/A N/A', '#N/A', 'N/A', 'n/a', 'NA', '#NA', 'NULL',
# 'null', 'NaN', '-NaN', 'nan', '-nan', ''].
df = pd.read_csv('local_path/file.csv', keep_default_na = False)

Read csv file and ignore missing value markers

In [47]:
# improve performance of reading a large file in data without any NAs
df = pd.read_csv('local_path/file.csv', header = 0, na_filter = False)

Read csv file and change the data type of a column

In [47]:
pd.read_csv('local_path/file.csv', dtype = {'column_x': float})

Write csv file

In [47]:
df.to_csv('local_path/file.csv')

Write csv file with | as fields separator

In [47]:
df = df.to_csv('local_path/file.csv', sep = '|')

Write csv file but not save the DataFrame index

In [ ]:
df.to_csv('local_path/file.csv', index = False)

Write csv file but not save the DataFrame header

In [ ]:
df.to_csv('local_path/file.csv', header = False)

Write csv file but only specific columns

In [47]:
df.to_csv('local_path/file.csv', columns = ['column_x', 'column_y'])

Write csv file; don’t use quotes and use backslash as escape character

In [47]:
df.to_csv('local_path/file.csv', quoting = csv.QUOTE_NONE, escapechar = '\\')

Append DataFrame to csv file

In [47]:
df.to_csv('local_path/file.csv', mode = 'a')

Drop a row if ANY values are missing

In [47]:
df = df.dropna()

Drop a row only if ALL values are missing

In [49]:
df = df.dropna(how='all')

Drop a column if ANY values are missing

In [49]:
df = df.dropna(axis = 1)

Drop a column only if ALL values are missing

In [49]:
df = df.dropna(how='all', axis = 1)

Drop duplicate rows keeping first occurrence

In [49]:
df = df.drop_duplicates()

Drop duplicate rows keeping last occurrence

In [49]:
df = df.drop_duplicates(keep='last')

Drop all duplicates

In [49]:
df = df.drop_duplicates(keep=False)

Drop duplicate rows identifying duplicates on the giving columns

In [49]:
df = df.drop_duplicates(subset=['column_x', 'column_y'])

Find duplicates based on giving columns

In [49]:
dup_df = df[df.duplicated(subset=['column_x', 'column_y'], keep=False)]

Count duplicates rows

In [49]:
df.duplicated().sum()

Count duplicates on column

In [49]:
df.column_x.duplicated().sum()

Replace all missing values with 0

In [49]:
df = df.fillna(value = 0)

Replace missing values with 0 on one column

In [ ]:
df.column_x = df.column_x.fillna(value = 0)

Replace missing values on multiple columns

In [50]:
df = df.fillna({
    'col1': 'missing',
    'col2': '99.999',
    'col3': '999',
    'col4': 'missing',
    'col5': 'missing',
    'col6': '99'
})

Replace missing values with forward fill (propagate non-null values forward)

In [51]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3, 4, np.nan, 1],
                  [np.nan, np.nan, np.nan, 5],
                  [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))

df_filled = df.fillna(method='ffill')

In [52]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [53]:
df_filled

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

Replace missing values with backward fill (propagate non-null values backward)

In [54]:
import numpy as np
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3, 4, np.nan, 1],
                  [np.nan, np.nan, np.nan, 5],
                  [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))

# use NEXT valid observation to fill gap/NAN
df_filled = df.fillna(method='bfill')

In [55]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [56]:
df_filled

     A    B   C  D
0  3.0  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  3.0 NaN  5
3  NaN  3.0 NaN  4

Replace all instances of a value in a column

In [ ]:
df.column_y = df.column_y.replace('old_string', 'new_string')

Count missing values in data

In [50]:
df.isnull().sum().sum()

Count missing values on each column / return Series

In [50]:
df.isnull().sum()

Count missing values on specific column

In [50]:
df.column_x.isnull().sum()

Percentage of missing values in data

In [50]:
# count of missing diveded by total data cells
(df.isnull().sum().sum()) / (df.shape[0] * df.shape[1]) * 100

Show rows with missing values on column

In [50]:
df[df.column_x.isnull()]
# or
df[pd.isnull(df.column_x)]

Show rows with no missing values on column

In [50]:
df[df.column_x.notnull()]

Convert all NaNs to None

In [50]:
df = df.where(pd.notnull(df), None)

Convert column to numeric (will error if column has non-numeric values)

In [56]:
df.column_x = pd.to_numeric(df.column_x)
# to avoid error and convert non-numeric to NaN
pd.to_numeric(df.column_x, errors='coerce')

Change data type of DataFrame column

In [56]:
df.column_x = df.column_x.astype('int64')
#to ignore errors
df.column_x = df.column_x.astype('int64', errors='ignore')
# pandas dtypes: float64 (float), int64 (integer), datetime64 (datetime), object (string)

Convert column to datetime (will error if column has datetime values)

In [56]:
df.column_x = pd.to_datetime(df.column_x)
# to avoid error and convert non-datetime to NaT
df.column_x = pd.to_datetime(df.column_x, errors='coerce')
# specify format of input data
# format can be any code of strftime directive: http://strftime.org/
df.column_x = pd.to_datetime(df.column_x, errors='coerce', format='%Y%m%d')

Split delimited values in a DataFrame column into two new columns

In [56]:
# `col` column may look like `string1:string2`
df['new_c1'], df['new_c2'] = zip(*df['col'].apply(lambda x: x.split(':', 2)))

Basic descriptive statistics for numeric columns

In [56]:
# count, mean, std, min, max, percentiles
df.describe()

Basic descriptive statistics for “object” columns (e.g. strings or timestamps)

In [56]:
# count, unique, top, and freq
df.describe(include = ['object'])

Basic descriptive statistics for all columns

In [56]:
df.describe(include = 'all')

Basic descriptive statistics for only one column

In [56]:
df.column_x.describe()
# or if column name has spaces
df['column x'].describe()

Count the number of occurrences of each value (excludes missing values)

In [56]:
df.column_x.value_counts()

Count the number of occurrences of each value (includes missing values)

In [56]:
df.column_x.value_counts(dropna = False)

Show the 3 most frequent occurances of column_x

In [56]:
df.column_x.value_counts()[0:3]

Count number of rows in a DataFrame

In [56]:
# quicker
len(df.index)
# or
len(df)
# or
df.shape[0]

Count number of distinct values in a column

In [56]:
df.column_x.nunique()

Get distinct values in a column

In [56]:
df.column_x.unique()

Randomly select 30% of rows without replacement

In [56]:
df.sample(frac=0.3)

Randomly select 30% of rows with replacement

In [56]:
df.sample(frac=0.3, replace=True)

Randomly select 10 rows

In [56]:
df.sample(n=10)

Randomly split a DataFrame into train/test

In [56]:
# will contain 75% of the rows
df_train = df.sample(frac=0.75)
# will contain the other 25% of rows
df_test = df[~df.index.isin(df_train.index)]

Get first 7 rows ordered by the given columns in descending order

In [56]:
# better performance
df.nlargest(7, ['column_x', 'column_y'])
# equivalent with
df.sort_values(['column_x', 'column_y'], ascending=False).head(7)

Get first 7 rows ordered by the given columns in ascending order

In [56]:
# better performance
df.nsmallest(7, ['column_x', 'column_y'])
# equivalent with
df.sort_values(['column_x', 'column_y'], ascending=True).head(7)

.loc selection by index/labels and columns

In [56]:
df.loc[<row selection>, <column selection>]

.loc select all rows and some columns by index/labels

In [56]:
df.loc[:, ['column1', 'column2', 'column3']]

.loc select some rows and all columns by index/labels

In [56]:
df.loc[['row1', 'row2'], :]
# or ommiting the colon for columns labels
df.loc[['row1', 'row2']]

.loc select some rows and some columns by index/labels

In [56]:
df.loc[['row1', 'row2'], ['column1', 'column2', 'column3']]

Select rows whose column values equal some value/scalar

In [56]:
df.loc[df['column_x'] == some_value]

Select rows whose column values do not equal some_value/scalar

In [56]:
df.loc[df['column_x'] != some_value]

Select rows whose column values are in a list

In [56]:
df.loc[df['column_x'].isin(['A', 'B', 'C'])]

Select rows whose column values are not in a list

In [56]:
df.loc[~df['column_x'].isin(['A', 'B', 'C'])]

Select rows that satisfy multiple and (&) boolean conditions

In [56]:
# note the parentheses due to python operators precedence!
df.loc[(df['column_x'] >= A) & (df['column_y'] <= B)]

Select rows that satisfy multiple or (|) boolean conditions

In [ ]:
# note the parentheses due to python operators precedence!
df.loc[(df['column_x'] >= A) | (df['column_y'] <= B)]

Update column values based on rows condition

In [56]:
df.loc[df['column_x'] >= A, 'column_y'] = new_value

Update multiple columns values based on rows condition

In [56]:
df.loc[df['column_x'] >= A, ['column_y', 'column_z']] = [new_value_y, new_value_z]

.loc selection for single label, all columns / returns a Series

In [80]:
df.loc['a']

Name    Alex
Age       10
Name: a, dtype: object

.loc selection for list of label, all columns / returns a DataFrame

In [78]:
df

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [79]:
df.loc[['a', 'b']]

   Name  Age
a  Alex   10
b   Bob   12

https://www.allthesnippets.com/browse/pandas/df_selection.html

.loc selection for all label, single column / returns a Series

In [77]:
# giving DataFrame df
df

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [76]:
df.loc[:, 'Age']

a    10
b    12
c    13
Name: Age, dtype: int64

.loc selection for multiple labels, multiple columns / returns a DataFrame

In [72]:
df

     name  age
a    Alex   10
b     Bob   12
c  Clarke   13

In [74]:
df=df.rename(columns = {'name':'Name','age':'Age'})

In [70]:
df

     name  age
a    Alex   10
b     Bob   12
c  Clarke   13

In [75]:
df.loc[['a', 'c'], ['Age', 'Name']]

   Age    Name
a   10    Alex
c   13  Clarke

.loc selection for slice of labels for row, all columns / returns a DataFrame


---

In [84]:
df

     Name  Age Occupation
a    Alex   10    Student
b     Bob   12    Teacher
c  Clarke   13   Engineer

In [83]:
df['Occupation'] =['Student','Teacher','Engineer']

In [85]:
df.loc[:, 'Age':'Occupation']

   Age Occupation
a   10    Student
b   12    Teacher
c   13   Engineer

.loc selection for rows and columns with boolean conditions

In [56]:
# length of boolean arrays must match dataframe size
# select rows 1 and 3 and first column
df.loc[[True, False, True], [True]]

In [86]:
df

     Name  Age Occupation
a    Alex   10    Student
b     Bob   12    Teacher
c  Clarke   13   Engineer

Select rows 1 and 3, and second column with boolean conditions

In [ ]:
df.loc[[True, False, True], [False, True]]

Select rows whose column values equals a scalar

In [ ]:
df
     Name  Age Occupation
a    Alex   10   Student
b     Bob   12   Teacher
c  Clarke   13  Engineer

df.loc[df['Name'] == 'Alex']

Select rows that satisfy multiple boolean conditions; keep selected columns

In [56]:
>>> df
     Name  Age Occupation
a    Alex   10   Student
b     Bob   12   Teacher
c  Clarke   13  Engineer

df.loc[(df['Name'] == 'Alex') | (df['Age'] == 12), ['Name', 'Occupation']]

Update column values based on rows condition

In [56]:
# giving DataFrame df
>>> df
     Name  Age Occupation
a    Alex   10   Student
b     Bob   12   Teacher
c  Clarke   13  Engineer

# update Alex Occupation to Grad Student
df.loc[(df['Name'] == 'Alex'), ['Occupation']] = 'Grad Student'

Update multiple columns values based on rows condition

In [56]:
>>> df
     Name  Age Occupation
a    Alex   10   Student
b     Bob   12   Teacher
c  Clarke   13  Engineer

# update Alex Age and Occupation to 20 years and Grad Student
df.loc[(df['Name'] == 'Alex'), ['Age', 'Occupation']] = [20, 'Grad Student']

.iloc position based selection (from 0 to length-1 of the axis)

In [56]:
df.iloc[<row selection>, <column selection>]

.iloc single row selections, all columns

In [56]:
# return Series object
df.iloc[0]  # first row of dataframe
df.iloc[1]  # second row of dataframe
df.iloc[-1] # last row of data frame

.iloc single column selections, all rows

In [56]:
# return Series object
df.iloc[:, 0]  # first column of dataframe
df.iloc[:, 1]  # second column of dataframe
df.iloc[:, -1] # last column of data frame

.iloc multiple row and column selections

In [56]:
# return DataFrame object
df.iloc[0:3]             # first three rows of dataframe, all columns
df.iloc[:, 0:3]          # first three columns of dataframe, all rows
df.iloc[0:5, 4:7]        # first five rows, column 4th, 5th and 6th of dataframe
df.iloc [[3, 4], [1, 2]] # retrieve rows 4th & 5th, columns 2nd & 3rd with lists

.iloc selection for rows and columns with boolean conditions

In [56]:
# length of boolean arrays must match dataframe size
# select rows 1 and 3 and first column
df.iloc[[True, False, True], [True]]

Select the rows whose index label is an even number

In [56]:
df.iloc[lambda x: x.index % 2 == 0]

Select slice of rows with .iloc

In [56]:
# start_pos is the index of the first row to retrieve
# stop_pos is the index of the row to stop (last row retrieved will have the index of `stop_pos -1`)
df.iloc[start_pos:stop_pos]

Update/set column values based on rows condition with .iloc

In [56]:
# set column 4 values to `new_value` for first two rows of data frame
df.iloc[0:2, 3] = 'new_value'

# set all column values to `new_value` for first two rows of data frame
df.iloc[0:2] = 'new_value'

Concatenate two DataFrames together, rows of df1 followed by rows of df2

In [56]:
df = pd.concat([df1, df2])

Concatenate two DataFrames together, df2 to the right side of df1

In [56]:
df = pd.concat([df1, df2], axis=1)

Concatenate multiple DataFrames together, appending rows horizontally

In [56]:
frames = [ process_input_file(f) for f in files ]
df = pd.concat(frames)

Append a single row to a DataFrame by passing a Series

In [56]:
df_new = df.append(s1, ignore_index=True)

In [5]:
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [6]:
s1 = pd.Series(['X0', '100'], index=['Name', 'Age'])
s1

Name     X0
Age     100
dtype: object

In [7]:
df_new = df.append(s1, ignore_index=True)
df_new

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13
3      X0  100

Append a single row to a DataFrame by passing a dict

In [ ]:
df_new = df.append(dict1, ignore_index=True)

Append a single row to a DataFrame by passing a dict

In [8]:
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [9]:
dicts = [{'Name': 'X1', 'Age': 100},
         {'Name': 'X2', 'Age': 200}]
dicts

[{'Age': 100, 'Name': 'X1'}, {'Age': 200, 'Name': 'X2'}]

In [11]:
df_new = df.append(dicts, ignore_index=True, sort=False)
df_new

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13
3      X1  100
4      X2  200

Inner Join two DataFrames on common key column

In [ ]:
# Use intersection of keys from both frames
df = pd.merge(df_left df_right, on='column_id')

# identical with
df = pd.merge(df_left df_right, left_on='column_id', right_on='column_id')

Left Join two DataFrames

In [ ]:
# Use keys from left frame only
df = pd.merge(df_left df_right, left_on='column_x', right_on='column_y', how='left')

Right Join two DataFrames

In [56]:
# Use keys from right frame only
df = pd.merge(df_left df_right, left_on='column_x', right_on='column_y', how='right')

Full Outer Join two DataFrames on common key column

In [56]:
# Use union of keys from both frames
df = pd.merge(df_left df_right, on='column_id', how='outer')

Inner Join two DataFrames on index

In [56]:
df = pd.merge(df_left df_right, left_index=True, right_index=True)

Join two DataFrames on nearest key (asof merge)

In [56]:
# This is similar to a left-join except that we match on nearest key rather than equal keys.
# Both DataFrames must be sorted by the key.
df = pd.merge_asof(df_left df_right, on='column_id', by='column_to_match')

Join two DataFrames on nearest key (asof merge)

In [56]:
df_merge_asof = pd.merge_asof(trades, quotes, on='time', by='ticker')

Transpose data frame (rows become columns, columns become rows)

In [11]:
df.T

Group by one column, one column aggregated, one aggregation

In [11]:
# returns series because we aggregate one column
df.groupby('col_grp_1')['col_agg_1'].min()

Group by two columns, one column aggregated, one aggregation

In [11]:
# returns series because we aggregate one column
df.groupby(['col_grp_1', 'col_grp_2'])['col_agg_1'].min()

Group by two columns, multiple columns aggregated, one aggregation

In [11]:
# returns data frame because we aggregate multiple columns, one aggregation
df.groupby(['col_grp_1', 'col_grp_2'])['col_agg_1', 'col_agg_2'].min()

Group by one column, one column aggregated, multiple aggregations

In [11]:
# returns data frame because of multiple aggregations
df.groupby('col_grp_1')['col_agg_1'].agg(['min', 'max', 'mean'])

Group by one column, multiple columns aggregated, multiple aggregations

In [11]:
# returns data frame with hierarchical index in columns
df1 = df.groupby('col_grp_1')['col_agg_1', 'col_agg_2'].agg(['min', 'max', 'mean', 'count'])
# flatten the hierarchical index in columns
df1.columns = ['_'.join(col).strip() for col in df1.columns.values]

Group by named aggregation: group by one column, multiple columns aggregated, multiple aggregations

In [ ]:
# from pandas version >= 0.25.0
df.groupby('col_grp_1').agg(new_col1_name=('col_agg_1', 'mean'), new_col2_name=('col_agg_2', 'count'))

Group by one column, one column aggregated, one aggregation

In [ ]:
# returns series because we aggregate one column
df.groupby('kind')['weight'].min()

Group by two columns, one column aggregated, one aggregation

In [13]:
# returns series because we aggregate one column
df.groupby(['kind', 'breed'])['weight'].min()

Group by two columns, multiple columns aggregated, one aggregation

In [13]:
df
  kind      breed  height  weight
0  cat    siamese     9.1     7.9
1  dog  chihuahua     6.0     7.5
2  cat    persian     9.5     9.9
3  dog   labrador    34.0   198.0
4  dog  chihuahua     3.5     5.5

# returns data frame because we aggregate multiple columns, one aggregation
df.groupby(['kind', 'breed'])['height', 'weight'].min()

                height  weight
kind breed
cat  persian       9.5     9.9
     siamese       9.1     7.9
dog  chihuahua     3.5     5.5
     labrador     34.0   198.0

Group by one column, one column aggregated, multiple aggregations

In [13]:
# giving DataFrame df
>>> df
  kind      breed  height  weight
0  cat    siamese     9.1     7.9
1  dog  chihuahua     6.0     7.5
2  cat    persian     9.5     9.9
3  dog   labrador    34.0   198.0
4  dog  chihuahua     3.5     5.5

df.groupby('kind')['weight'].agg(['min', 'max', 'mean'])

# returns data frame because of multiple aggregations
      min    max       mean
kind
cat   7.9    9.9   8.900000
dog   5.5  198.0  70.333333

Group by one column, multiple columns aggregated, multiple aggregations

In [13]:
# giving DataFrame df
>>> df
  kind      breed  height  weight
0  cat    siamese     9.1     7.9
1  dog  chihuahua     6.0     7.5
2  cat    persian     9.5     9.9
3  dog   labrador    34.0   198.0
4  dog  chihuahua     3.5     5.5

# returns data frame with hierarchical index in columns
df1 = df.groupby('kind')['weight', 'height'].agg(['min', 'max', 'count'])
# flatten the hierarchical index in columns
df1.columns = ['_'.join(col).strip() for col in df1.columns.values]
print(df1)

      weight_min  weight_max  weight_count  height_min  height_max  height_count
kind
cat          7.9         9.9             2         9.1         9.5             2
dog          5.5       198.0             3         3.5        34.0             3

Filter (within a GroupBy), filters the rows on a property of the group they belong to

In [13]:
# will return a subset DataFrame of rows belonging to the groups satisfying condition
df1 = df.groupby('col_grp').filter(lambda x : x['col'].mean() > 20)

Transform (within a GroupBy), calculates a new value for each row based on a property of the group

In [13]:
df['grp_mean'] = df.groupby('col_grp')['col'].transform(lambda x : x.mean())

Center the data by subtracting the group-wise mean

In [13]:
# will return a new DataFrame with same size as the original
df_new = df.groupby('col_grp').transform(lambda x: x - x.mean())

Apply (within a GroupBy), applies an arbitrary function to the group results

In [13]:
def func_normalize(x):
  # x is a DataFrame of group values
  x['col1'] = x['col1'] / x['col2'].sum()

  return x

# normalizes the first column by the sum of the second:
df = df.groupby('col_grp').apply(func_normalize)

Get top n rows for each group of columns in a sorted dataframe

In [13]:
# sort DataFrame first by some columns
df = df.sort_values(['col_x','col_y'])
df_top_5 = df.groupby('col_x').head(5)

Get bottom n rows for each group of columns in a sorted dataframe

In [13]:
# sort DataFrame first by some columns
df = df.sort_values(['col_x','col_y'])
df_bottom_5 = df.groupby('col_x').tail(5)

In [13]:
https://www.allthesnippets.com/search/index.html?refinementList%5Bcategory%5D%5B0%5D=Reshape%20Data&refinementList%5Bcategory%5D%5B1%5D=DataFrame%20Basics&refinementList%5Bsubject%5D%5B0%5D=Pandas